РазработкаОУМобильная/src/AccumulationRegisters/УГМК_ИсторияЗаказа/УГМК_ИсторияЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УГМК_ИсторияЗаказа</name>
  <registerType>Turnovers</registerType>
  </aggregates>
  <resources>
    <name>КоличествоМест</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМестПродукции</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПродукции</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>tb_НоменклатураID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маржа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияЗаказаПокупателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Продукция</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПродукции</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказВыпуска</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.УГМК_СостоянияЗаказа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПаспортПартии</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      <types>BusinessProcessRef.УГМК_ПаспортПартииСТК</types>
      <types>BusinessProcessRef.УГМК_ПартияСырья</types>
      <types>BusinessProcessRef.УГМК_Плавка</types>
      <types>BusinessProcessRef.УГМК_ПаспортПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.ТочкиМаршрута</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.СотрудникиОрганизаций</types>
      <types>CatalogRef.РабочиеЦентры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СК_МаркиСплавов</types>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

РазработкаОУМобильная/src/AccumulationRegisters/УГМК_ИсторияЗаказа/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Для каждого Запись из ЭтотОбъект цикл
		Если (не ЗначениеЗаполнено( Запись.Заказ)) и (Запись.Заказ <> Неопределено) тогда
			Запись.Заказ = Неопределено;
		КонецЕсли;
		Если (не ЗначениеЗаполнено( Запись.ЗаказВыпуска)) и (Запись.ЗаказВыпуска <> Неопределено) тогда
			Запись.ЗаказВыпуска = Неопределено;
		КонецЕсли;
		Если (не ЗначениеЗаполнено( Запись.ТочкаМаршрута)) и (Запись.ТочкаМаршрута <> Неопределено) тогда
			Запись.ТочкаМаршрута = Неопределено;
		КонецЕсли;
		Если (не ЗначениеЗаполнено( Запись.Номенклатура)) и (Запись.Номенклатура <> Неопределено) тогда
			Запись.Номенклатура = Неопределено;
		КонецЕсли;
		Если (не ЗначениеЗаполнено( Запись.ХарактеристикаНоменклатуры)) и (Запись.ХарактеристикаНоменклатуры <> Неопределено) тогда
			Запись.ХарактеристикаНоменклатуры = Неопределено;
		КонецЕсли;
		Если (не ЗначениеЗаполнено( Запись.СерияНоменклатуры)) и (Запись.СерияНоменклатуры <> Неопределено) тогда
			Запись.СерияНоменклатуры = Неопределено;
		КонецЕсли;
		Если (не ЗначениеЗаполнено( Запись.ПаспортПартии)) и (Запись.ПаспортПартии <> Неопределено) тогда
			Запись.ПаспортПартии = Неопределено;
		КонецЕсли;
	КонецЦикла
КонецПроцедуры
